franzbischoff/false.alarm.io/sdkconfig.defaults.prod
# false.alarm.io - production size profile
#
# This profile is intentionally stricter than sdkconfig.defaults.
# Goal: reduce final firmware size for offline runtime (SD + MPX + alert).

# Base target/partition choices
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# Compiler profile tuned for smallest binary
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=0

# Keep C++ runtime slim
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# CONFIG_COMPILER_CXX_RTTI is not set

# Deterministic sampling timing (4ms at 250Hz)
CONFIG_FREERTOS_HZ=1000

# Keep only low default logging in production
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_LOG_DEFAULT_LEVEL=1
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL=5

# Timestamp support for queued samples
CONFIG_ESP_TIME_FUNCS_USE_ESP_TIMER=y
CONFIG_ESP_TIME_FUNCS_USE_RTC_TIMER=y

# SD card path needs FATFS
CONFIG_FATFS_CODEPAGE_437=y
CONFIG_FATFS_CODEPAGE=437
CONFIG_FATFS_PER_FILE_CACHE=y

# Keep watchdog protection in long-running runtime tasks
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y

# Production profile is offline for now: disable network stack and related features
# CONFIG_ESP_WIFI_ENABLED is not set
# CONFIG_LWIP_ENABLE is not set
# CONFIG_ESP_TLS_USING_MBEDTLS is not set
CONFIG_MBEDTLS_TLS_DISABLED=y
# CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS is not set
# CONFIG_MQTT_PROTOCOL_311 is not set
# CONFIG_MQTT_TRANSPORT_SSL is not set
# CONFIG_MQTT_TRANSPORT_WEBSOCKET is not set
# CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE is not set
# CONFIG_BT_ENABLED is not set
